{
  "id": "FormulePolytechniqueMontreal",
  "title": "Formule Polytechnique Montréal",
  "date": "2025-06-01",
  "cover": "./logo.png",
  "tags": ["STM32", "Télémetrie", "Xbee", "CAN", "Firmware", "Équipe", "Projet étudiant"],
  "content": "## Contexte\n\nDans le cadre de mon échange à **Polytechnique Montréal**, j’ai rejoint l’association **Formule Polytechnique Montréal**, une équipe étudiante construisant une voiture de course électrique pour des compétitions internationales.\n\nMon rôle au sein de l'équipe **software** m’a permis de travailler sur des composants essentiels de la voiture en interaction directe avec les systèmes embarqués et de communication.\n\n## Réalisations techniques\n\n- **Portage firmware BMS** : Migration du système de gestion de batterie depuis un **STM32F4** vers un **STM32L4**, optimisant ainsi la consommation d’énergie et l’intégration avec le reste du système.\n- **Développement d'une solution de télémétrie temps réel** : Utilisation de **modules Xbee** pour transmettre des données critiques pendant les essais et les courses.\n- **Création d'une heatmap batterie** : Agrégation des données issues des capteurs **CAN** pour visualiser en temps réel la température des cellules et surveiller leur comportement.\n- **Automatisation des données Motec** : Parsing des données générées par les calculateurs de la voiture (système Motec) et transmission vers un serveur de visualisation pour faciliter l’analyse post-course.\n\n## Esprit d’équipe et méthode\n\nL'intégration dans cette équipe multidisciplinaire m’a permis de travailler dans un environnement proche de celui de l’ingénierie en entreprise, où rigueur, communication et documentation sont primordiaux. Les échanges entre les pôles mécaniques, électroniques et logiciels ont été constants et riches.\n\nCe projet m’a permis de renforcer mes compétences en **développement embarqué**, **communication sans fil**, **protocole CAN**, et gestion de projets **temps réel** dans un environnement dynamique et compétitif.\n\n---"
}